public_html/linux_mint.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2026-03-20 vie 13:37 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>linux mint</title>
<meta name="author" content="Sherlockes" />
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' type='text/css' href='https://gongzhitaao.org/orgcss/org.css'/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">linux mint</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org57835fa">1. Primeros pasos tras instalacion</a></li>
<li><a href="#orgaa0eb41">2. Areas de trabajo</a></li>
<li><a href="#org148c68e">3. Comandos básicos</a></li>
<li><a href="#org6fd8262">4. Instalar Emacs 26.3</a></li>
<li><a href="#org43e6bec">5. Error en el arranque "failed to open \EFI\ubuntu\ - Not Found"</a></li>
<li><a href="#org3f2aab6">6. Tarjeta de red inalámbrica inestable</a></li>
</ul>
</div>
</div>
<p>
Linux Mint es una distribución de GNU/Linux comunitaria de origen franco-irlandesa basada en Ubuntu, y a su vez en Debian, que tiene por objetivo proveer "un sistema operativo moderno, elegante y cómodo que sea tanto poderoso como fácil de usar". Linux Mint soporta varios formatos y códecs multimedia al incluir software propietario y empaquetado con una variedad de aplicaciones gratuitas y de código abierto.
</p>

<!--more-->

<div id="outline-container-org57835fa" class="outline-2">
<h2 id="org57835fa"><span class="section-number-2">1.</span> <a href="linux_mint_post_instalacion.html#ID-b4403a25-934c-4646-9fd2-94823456075f">Primeros pasos tras instalacion</a></h2>
</div>

<div id="outline-container-orgaa0eb41" class="outline-2">
<h2 id="orgaa0eb41"><span class="section-number-2">2.</span> Areas de trabajo</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Cambio entre áreas de trabajo -&gt; Ctrl+Alt+⬆️</li>
<li>Siguiente area de trabajo -&gt; Ctrl+Alt+➡️</li>
<li>Anterior area de trabajo -&gt; Ctrl+Alt+⬅</li>
<li>Mueve la aplicación al siguiente area de trabajo -&gt; Ctrl+Alt+Mayusc+➡️</li>
<li>Mueve la aplicación al antgerior area de trabajo -&gt; Ctrl+Alt+Mayusc+⬅️</li>
</ul>
</div>
</div>

<div id="outline-container-org148c68e" class="outline-2">
<h2 id="org148c68e"><span class="section-number-2">3.</span> Comandos básicos</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>Alt+espacio -&gt; Abre el menú ventana</li>
</ul>
</div>
</div>

<div id="outline-container-org6fd8262" class="outline-2">
<h2 id="org6fd8262"><span class="section-number-2">4.</span> Instalar Emacs 26.3</h2>
<div class="outline-text-2" id="text-4">
<p>
<a href="https://ubunlog.com/llega-la-tercera-version-de-la-rama-26-de-emacs-gnu-emacs-26-3/#Como_instalar_Gnu_Emacs_263_en_Ubuntu_y_derivados">Enlace</a>
</p>
<div class="org-src-container">
<pre class="src src-bash">sudo add-apt-repository ppa:kelleyk/emacs -y
sudo apt-get update
sudo apt-get install emacs26
</pre>
</div>
</div>
</div>


<div id="outline-container-org43e6bec" class="outline-2">
<h2 id="org43e6bec"><span class="section-number-2">5.</span> Error en el arranque "failed to open \EFI\ubuntu\ - Not Found"</h2>
<div class="outline-text-2" id="text-5">
<p>
I had that problem, too. It seems like it occurs on older systems that support UEFI but not secure boot. This fixed it for me (change sda for your system)
</p>

<div class="org-src-container">
<pre class="src src-bash">sudo grub-install --no-uefi-secure-boot /dev/sda
sudo update-grub
</pre>
</div>
</div>
</div>


<div id="outline-container-org3f2aab6" class="outline-2">
<h2 id="org3f2aab6"><span class="section-number-2">6.</span> Tarjeta de red inalámbrica inestable</h2>
<div class="outline-text-2" id="text-6">
<p>
``` bash
sudo nano /etc/modprobe.d/iwlwifi.conf
```
``` bash
options iwlwifi 11n<sub>disable</sub>=1
options iwlwifi power<sub>save</sub>=0
options iwlwifi bt<sub>coex</sub><sub>active</sub>=0
```
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: 2023-08-30</p>
<p class="author">Author: Sherlockes</p>
<p class="date">Created: 2026-03-20 vie 13:37</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
